Building the base report

In [ ]:
-- Query the sport and distinct number of athletes
SELECT 
    sport, 
    COUNT(DISTINCT athlete_id) AS athletes
FROM summer_games
GROUP BY sport
-- Only include the 3 sports with the most athletes
ORDER BY athletes DESC
LIMIT 3;

Athletes vs events by sport

In [ ]:
-- Query sport, events, and athletes from summer_games
SELECT 
    sport, 
    COUNT(DISTINCT event) AS events, 
    COUNT(DISTINCT athlete_id) AS athletes
FROM summer_games
GROUP BY sport;

Age of oldest athlete by region

In [ ]:
-- Select the age of the oldest athlete for each region
SELECT 
    region, 
    MAX(a.age) AS age_of_oldest_athlete
FROM summer_games AS s
-- First JOIN statement
JOIN athletes AS a
    ON s.athlete_id = a.id
-- Second JOIN statement
JOIN countries AS c
    ON s.country_id = c.id
GROUP BY region

Number of events in each sport

In [ ]:
-- Select sport and events for summer sports
SELECT 
    sport, 
    COUNT(DISTINCT event) AS events
FROM summer_games
GROUP BY sport
UNION
-- Select sport and events for winter sports
SELECT 
    sport, 
    COUNT(DISTINCT event) AS events
FROM winter_games
GROUP BY sport
-- Show the most events at the top of the report
ORDER BY events DESC;

Exploring summer_games

In [ ]:
-- Update the query to explore the bronze field
SELECT bronze
FROM summer_games;

In [ ]:
-- Update query to explore the unique bronze field values
SELECT DISTINCT bronze
FROM summer_games;

In [ ]:
-- Recreate the query by using GROUP BY 
SELECT bronze
FROM summer_games
GROUP BY bronze;

In [ ]:
-- Add the rows column to your query
SELECT 
    bronze, 
    COUNT(*) AS rows
FROM summer_games
GROUP BY bronze;

Validating our query

In [ ]:
-- Pull total_bronze_medals from summer_games below
SELECT SUM(bronze) AS total_bronze_medals
FROM summer_games;

In [ ]:
/* Pull total_bronze_medals from summer_games below
SELECT SUM(bronze) AS total_bronze_medals
FROM summer_games; 
>> OUTPUT = 141 total_bronze_medals */

-- Setup a query that shows bronze_medal by country
SELECT 
    c.country, 
    SUM(s.bronze) AS bronze_medals
FROM summer_games AS s
JOIN countries AS c
ON s.country_id = c.id
GROUP BY c.country;

In [ ]:
/* Pull total_bronze_medals from summer_games below
SELECT SUM(bronze) AS total_bronze_medals
FROM summer_games; 
>> OUTPUT = 141 total_bronze_medals */

-- Select the total bronze_medals from your query
SELECT SUM(bronze_medals)
FROM 
-- Previous query is shown below.  Alias this AS subquery.
  (SELECT 
      country, 
      SUM(bronze) AS bronze_medals
  FROM summer_games AS s
  JOIN countries AS c
      ON s.country_id = c.id
  GROUP BY country) AS subquery
;

Report 1: Most decorated summer athletes

In [ ]:
-- Pull athlete_name and gold_medals for summer games
SELECT 
    a.name AS athlete_name, 
    SUM(gold) AS gold_medals
FROM summer_games AS s
JOIN athletes AS a
ON s.athlete_id = a.id
GROUP BY a.name
-- Filter for only athletes with 3 gold medals or more
HAVING SUM(gold) > 2
-- Sort to show the most gold medals at the top
ORDER BY gold_medals DESC;